#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```hcl
module.dns_tunnel.random_bytes.tunnel_secret["affine-mcp"]: Refreshing state...
module.dns_web.cloudflare_dns_record.web["www"]: Refreshing state... [id=9c1cc6e7c730638371052242daa24f10]
module.dns_web.cloudflare_dns_record.web["domainconnect"]: Refreshing state... [id=8c2dc3c5948ccc6e863647501ded8de1]
module.dns_mail.cloudflare_dns_record.dkim["dkim"]: Refreshing state... [id=6553784b4785438207cb4f2462096f6e]
module.dns_web.cloudflare_dns_record.web["auth"]: Refreshing state... [id=afb539069d3c6210fd64ac172ea17c4e]
module.dns_web.cloudflare_dns_record.web["home"]: Refreshing state... [id=ef7e577ae43af8131275f2d2ed4c6c83]
module.api_worker.cloudflare_dns_record.api: Refreshing state... [id=36aec8e6778a6b469c85017d19ac6569]
module.dns_web.cloudflare_dns_record.web["dev"]: Refreshing state... [id=21c645c916085b58b79798ee3ba5a867]
module.dns_web.cloudflare_dns_record.web["fairview"]: Refreshing state... [id=754bf6c9169f6fffe66b28fe6107c808]
module.dns_tunnel.cloudflare_zero_trust_access_policy.email["affine-mcp"]: Refreshing state... [id=7064c503-274e-4abf-95d4-5932b715e4e3]
module.dns_web.cloudflare_dns_record.web["admin"]: Refreshing state... [id=e3999beb8de1e600f95786095aa99d8c]
module.dns_web.cloudflare_dns_record.web["root"]: Refreshing state... [id=d283453db7503a30f34b0e1109f9074e]
module.dns_tunnel.cloudflare_zero_trust_access_policy.service_token["affine-mcp"]: Refreshing state... [id=7bec0761-db53-4241-88fd-3cd1f3efb13a]
module.dns_mail.cloudflare_dns_record.dmarc["dmarc"]: Refreshing state... [id=1a5c6917ff3be5cb90282c4282f07e89]
module.api_worker.cloudflare_workers_script.api_proxy: Refreshing state... [id=api-proxy]
module.mcp_gateway.cloudflare_workers_script.mcp_gateway: Refreshing state... [id=mcp-gateway]
module.mcp_gateway.cloudflare_dns_record.mcp_gateway: Refreshing state... [id=82edf758a2003d57b9a86ba55580afd3]
module.zone_settings.cloudflare_zone_setting.always_use_https[0]: Refreshing state... [id=always_use_https]
module.dns_mail.cloudflare_dns_record.spf["spf"]: Refreshing state... [id=cf0b5da924f5af865f7449fbabcfe7f5]
module.dns_verification.cloudflare_dns_record.verification["api-acme"]: Refreshing state... [id=c01bde349d63d3f689a367796e91ad6b]
module.dns_verification.cloudflare_dns_record.verification["api-hosting"]: Refreshing state... [id=553186b6054a3d1fa3ab34a7fc47af85]
module.dns_verification.cloudflare_dns_record.verification["dmarc-cloudflare"]: Refreshing state... [id=1b8a98af0e8251f55739467b376ab89f]
module.dns_tunnel.cloudflare_zero_trust_access_service_token.token["affine-mcp"]: Refreshing state... [id=cf208fa4-a3f7-4a86-bf15-5a0e4f339856]
module.dns_mail.cloudflare_dns_record.mx["2"]: Refreshing state... [id=3fdbc5e38335d5ea438bdf8a71a0244d]
module.zone_settings.cloudflare_ruleset.www_redirect[0]: Refreshing state... [id=03950d4caa5a47ee8a9a635ddf54d84d]
module.dns_mail.cloudflare_dns_record.mx["0"]: Refreshing state... [id=ef829d65332fac7acbb900193e6bd377]
module.dns_mail.cloudflare_dns_record.mx["4"]: Refreshing state... [id=d3f54992c7ca80f30c2ce65bd432a351]
module.dns_mail.cloudflare_dns_record.mx["1"]: Refreshing state... [id=e38d60e026b6dbc6b782a2ef1105c4c4]
module.dns_mail.cloudflare_dns_record.mx["3"]: Refreshing state... [id=2a838bf3ca519420d4ab5a1ab08c7c44]
module.dns_tunnel.cloudflare_zero_trust_tunnel_cloudflared.tunnel["affine-mcp"]: Refreshing state... [id=2036e716-b9da-49d0-aa25-cfdbd58ce4f9]
module.dns_tunnel.cloudflare_zero_trust_access_application.app["affine-mcp"]: Refreshing state... [id=dd7c2d4d-1a2e-4c68-bc65-1044374cb2fc]
module.dns_tunnel.cloudflare_dns_record.tunnel_cname["affine-mcp"]: Refreshing state... [id=48517662f0c14e80d369f5b017fa8411]
module.dns_tunnel.cloudflare_zero_trust_tunnel_cloudflared_config.config["affine-mcp"]: Refreshing state... [id=2036e716-b9da-49d0-aa25-cfdbd58ce4f9]
module.api_worker.cloudflare_workers_route.api: Refreshing state... [id=8500fcfb04bc4a8eb9368e9cafc7bfd6]
module.mcp_gateway.cloudflare_workers_route.mcp_gateway: Refreshing state... [id=a0bb02528b8a4f3b8747244a539f49d2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.dns_tunnel.cloudflare_dns_record.tunnel_cname["firecrawl-mcp"] will be created
  + resource "cloudflare_dns_record" "tunnel_cname" {
      + content          = (known after apply)
      + created_on       = (known after apply)
      + id               = (known after apply)
      + meta             = (known after apply)
      + modified_on      = (known after apply)
      + name             = "firecrawl-mcp"
      + proxiable        = (known after apply)
      + proxied          = true
      + settings         = (known after apply)
      + tags             = (known after apply)
      + tags_modified_on = (known after apply)
      + ttl              = 1
      + type             = "CNAME"
      + zone_id          = "806c2f971876ec222cf0a28bca4bd9a9"
    }

  # module.dns_tunnel.cloudflare_zero_trust_access_application.app["firecrawl-mcp"] will be created
  + resource "cloudflare_zero_trust_access_application" "app" {
      + account_id                 = "c83c77a9f77705285912f49f14897e6b"
      + app_launcher_visible       = false
      + aud                        = (known after apply)
      + destinations               = (known after apply)
      + domain                     = "firecrawl-mcp.briananderson.xyz"
      + http_only_cookie_attribute = true
      + id                         = (known after apply)
      + name                       = "firecrawl-mcp"
      + policies                   = [
          + {
              + id         = (known after apply)
              + precedence = 1
            },
          + {
              + id         = (known after apply)
              + precedence = 2
            },
        ]
      + self_hosted_domains        = (known after apply)
      + service_auth_401_redirect  = true
      + session_duration           = "24h"
      + skip_interstitial          = true
      + type                       = "self_hosted"
    }

  # module.dns_tunnel.cloudflare_zero_trust_access_policy.email["firecrawl-mcp"] will be created
  + resource "cloudflare_zero_trust_access_policy" "email" {
      + account_id       = "c83c77a9f77705285912f49f14897e6b"
      + decision         = "allow"
      + id               = (known after apply)
      + include          = [
          + {
              + email = {
                  + email = "brian@briananderson.xyz"
                }
            },
        ]
      + name             = "Allow emails for firecrawl-mcp"
      + session_duration = "24h"
    }

  # module.dns_tunnel.cloudflare_zero_trust_access_policy.service_token["firecrawl-mcp"] will be created
  + resource "cloudflare_zero_trust_access_policy" "service_token" {
      + account_id       = "c83c77a9f77705285912f49f14897e6b"
      + decision         = "non_identity"
      + id               = (known after apply)
      + include          = [
          + {
              + any_valid_service_token = {}
            },
        ]
      + name             = "Allow firecrawl-mcp-ai-clients"
      + session_duration = "24h"
    }

  # module.dns_tunnel.cloudflare_zero_trust_access_service_token.token["firecrawl-mcp"] will be created
  + resource "cloudflare_zero_trust_access_service_token" "token" {
      + account_id            = "c83c77a9f77705285912f49f14897e6b"
      + client_id             = (known after apply)
      + client_secret         = (sensitive value)
      + client_secret_version = 1
      + duration              = "8760h"
      + expires_at            = (known after apply)
      + id                    = (known after apply)
      + name                  = "firecrawl-mcp-ai-clients"
    }

  # module.dns_tunnel.cloudflare_zero_trust_tunnel_cloudflared.tunnel["firecrawl-mcp"] will be created
  + resource "cloudflare_zero_trust_tunnel_cloudflared" "tunnel" {
      + account_id        = "c83c77a9f77705285912f49f14897e6b"
      + account_tag       = (known after apply)
      + config_src        = "cloudflare"
      + connections       = (known after apply)
      + conns_active_at   = (known after apply)
      + conns_inactive_at = (known after apply)
      + created_at        = (known after apply)
      + deleted_at        = (known after apply)
      + id                = (known after apply)
      + metadata          = (known after apply)
      + name              = "firecrawl-mcp"
      + remote_config     = (known after apply)
      + status            = (known after apply)
      + tun_type          = (known after apply)
      + tunnel_secret     = (sensitive value)
    }

  # module.dns_tunnel.cloudflare_zero_trust_tunnel_cloudflared_config.config["firecrawl-mcp"] will be created
  + resource "cloudflare_zero_trust_tunnel_cloudflared_config" "config" {
      + account_id = "c83c77a9f77705285912f49f14897e6b"
      + config     = {
          + ingress = [
              + {
                  + hostname = "firecrawl-mcp.briananderson.xyz"
                  + service  = "http://localhost:3000"
                },
              + {
                  + service = "http_status:404"
                },
            ]
        }
      + created_at = (known after apply)
      + id         = (known after apply)
      + source     = (known after apply)
      + tunnel_id  = (known after apply)
      + version    = (known after apply)
    }

  # module.dns_tunnel.random_bytes.tunnel_secret["firecrawl-mcp"] will be created
  + resource "random_bytes" "tunnel_secret" {
      + base64 = (sensitive value)
      + hex    = (sensitive value)
      + length = 32
    }

  # module.dns_web.cloudflare_dns_record.web["auth"] will be updated in-place
  ~ resource "cloudflare_dns_record" "web" {
      + comment     = ""
        id          = "afb539069d3c6210fd64ac172ea17c4e"
      ~ modified_on = "2026-02-15T05:56:25Z" -> (known after apply)
        name        = "auth.briananderson.xyz"
        tags        = []
        # (9 unchanged attributes hidden)
    }

  # module.dns_web.cloudflare_dns_record.web["domainconnect"] will be updated in-place
  ~ resource "cloudflare_dns_record" "web" {
      + comment     = ""
        id          = "8c2dc3c5948ccc6e863647501ded8de1"
      ~ modified_on = "2026-02-15T05:56:25Z" -> (known after apply)
        name        = "_domainconnect.briananderson.xyz"
        tags        = []
        # (9 unchanged attributes hidden)
    }

  # module.dns_web.cloudflare_dns_record.web["fairview"] will be updated in-place
  ~ resource "cloudflare_dns_record" "web" {
      + comment     = ""
        id          = "754bf6c9169f6fffe66b28fe6107c808"
      ~ modified_on = "2026-01-22T15:43:43Z" -> (known after apply)
        name        = "fairview.briananderson.xyz"
        tags        = []
        # (9 unchanged attributes hidden)
    }

Plan: 8 to add, 3 to change, 0 to destroy.

Changes to Outputs:
  ~ service_token_credentials = (sensitive value)
  ~ tunnel_cnames             = {
      + firecrawl-mcp = "firecrawl-mcp"
        # (1 unchanged attribute hidden)
    }
  ~ tunnel_ids                = {
      + firecrawl-mcp = (known after apply)
        # (1 unchanged attribute hidden)
    }
  ~ tunnel_info               = {
      + firecrawl-mcp = {
          + id     = (known after apply)
          + status = (known after apply)
        }
        # (1 unchanged attribute hidden)
    }

Warning: Resource Destruction Considerations

  with module.dns_tunnel.cloudflare_zero_trust_tunnel_cloudflared_config.config["firecrawl-mcp"],
  on modules/dns_tunnel/main.tf line 32, in resource "cloudflare_zero_trust_tunnel_cloudflared_config" "config":
  32: resource "cloudflare_zero_trust_tunnel_cloudflared_config" "config" {

This resource cannot be destroyed from Terraform. If you create this
resource, it will be present in the API until manually deleted.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @briananderson1222, Action: `pull_request`, Workflow: `Terraform`*